[
  {
    "slug": "tajweed",
    "name": "Qur'anic Recitation (Tajweed)",
    "summary": "Mastery of recitation rules and articulation with proper pronunciation and melody.",
    "description": "Our comprehensive Tajweed program focuses on the precise articulation of Qur'anic verses according to classical rules. Students learn proper pronunciation, rhythm, and melody under expert guidance.",
    "duration": "2 years",
    "prerequisites": "Basic Arabic reading ability"
  },
  {
    "slug": "hifz",
    "name": "Hifz Program", 
    "summary": "Memorization and revision methodology with dedicated mentoring and support.",
    "description": "Complete memorization of the Holy Quran with systematic revision techniques. Our experienced teachers provide personalized guidance for each student's memorization journey.",
    "duration": "3-5 years",
    "prerequisites": "Age 8-16 preferred"
  },
  {
    "slug": "hadith",
    "name": "Hadith Studies",
    "summary": "Foundational texts, methodology, and commentary of Prophetic traditions.",
    "description": "In-depth study of authentic Hadith collections including Sahih Bukhari, Sahih Muslim, and other classical works. Students learn the science of Hadith and its practical application.",
    "duration": "4 years",
    "prerequisites": "Intermediate Arabic proficiency"
  },
  {
    "slug": "fiqh",
    "name": "Fiqh & Usul",
    "summary": "Islamic jurisprudence principles and their practical application in daily life.",
    "description": "Comprehensive study of Islamic law covering worship, transactions, family matters, and contemporary issues. Students develop skills in legal reasoning and fatwa methodology.",
    "duration": "5 years", 
    "prerequisites": "Advanced Arabic and basic Islamic studies"
  },
  {
    "slug": "arabic",
    "name": "Arabic Language",
    "summary": "Classical Arabic grammar, morphology, and comprehension skills development.",
    "description": "Structured program covering Arabic grammar (Nahw), morphology (Sarf), rhetoric (Balagha), and literature. Essential foundation for all Islamic studies.",
    "duration": "3 years",
    "prerequisites": "Basic literacy"
  },
  {
    "slug": "library",
    "name": "Library Services",
    "summary": "Comprehensive catalog, reading rooms, and research access for scholarly pursuits.",
    "description": "State-of-the-art library with over 15,000 books, manuscripts, and digital resources. Quiet study spaces and research assistance available for students and faculty.",
    "facilities": ["Reading halls", "Digital archives", "Reference section", "Manuscript collection"]
  },
  {
    "slug": "hostel",
    "name": "Student Hostel",
    "summary": "On-campus accommodation with comprehensive student welfare services.",
    "description": "Safe and comfortable accommodation for out-of-town students. Includes meals, study halls, recreational facilities, and 24/7 supervision.",
    "facilities": ["Dormitory rooms", "Dining hall", "Study rooms", "Recreation area", "Medical care"]
  },
  {
    "slug": "mosque",
    "name": "Campus Mosque",
    "summary": "Central place of worship hosting congregational prayers and community programs.",
    "description": "Beautiful mosque serving as the spiritual center of our campus. Regular congregational prayers, Friday sermons, and special programs throughout the year.",
    "facilities": ["Prayer halls", "Ablution areas", "Community hall", "Audio system"]
  }
]